# 실습; 영화제목

In [1]:
# 실습01 영화 타이틀
# 1. 영화 타이틀 데이터 셋 - movws_title.csv
# 2. titles의 df 구성
# 3. df 필수 명령 8개 실행
# 4. 전체 영화는 몇 개인가?
# 5. 가장 빠른 시기에 제작된 영화 2개
# 6. 제목이 'Hamlet'인 영화는 몇 개인가?
# 7. 제목이 'Treasure Island'는 몇 개인가? 제작년도 오름차순 나열
# 8. 1950년에서 1959년 사이에 만들어진 영화는 몇 개인가?

import numpy as np
import pandas as pd
print('np ver', np.__version__)
print('pd ver', pd.__version__)

mtcsv = pd.read_csv("C:/Users/toto/Google Drive/sync/python/db/movies_title.csv")

np ver 1.20.1
pd ver 1.2.4

In [2]:
# 2. titles df 구성
mt = pd.DataFrame(mtcsv)
mt

                          title  year
0                The Rising Son  1990
1             Ashes of Kukulcan  2016
2       The Thousand Plane Raid  1969
3              Crucea de piatra  1993
4                        The 86  2015
...                         ...   ...
215976           Le mouton noir  1922
215977      Edge of the Unknown  2015
215978                    E yue  2005
215979             Lakota Girls  2015
215980             The Sting II  1983

[215981 rows x 2 columns]

In [3]:
# 3. 필수 명령 8개
print(mt.head())
print(mt.tail())

                     title  year
0           The Rising Son  1990
1        Ashes of Kukulcan  2016
2  The Thousand Plane Raid  1969
3         Crucea de piatra  1993
4                   The 86  2015
                      title  year
215976       Le mouton noir  1922
215977  Edge of the Unknown  2015
215978                E yue  2005
215979         Lakota Girls  2015
215980         The Sting II  1983

In [4]:
print(mt.shape)
print(mt.columns)
print(mt.info())

(215981, 2)
Index(['title', 'year'], dtype='object')
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 215981 entries, 0 to 215980
Data columns (total 2 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   title   215981 non-null  object
 1   year    215981 non-null  int64
dtypes: int64(1), object(1)
memory usage: 3.3+ MB
None

In [5]:
print(mt.isnull().sum())
print(mt.describe())

title    0
year     0
dtype: int64
                year
count  215981.000000
mean     1984.553822
std        29.343957
min      1894.000000
25%      1965.000000
50%      1994.000000
75%      2010.000000
max      2024.000000

In [6]:
print(mt['title'].value_counts())
print(mt['year'].value_counts())

Hamlet                  19
Macbeth                 14
Carmen                  14
The Three Musketeers    12
She                     11
                        ..
Tokyo odori              1
Jui kuen                 1
Rushlights               1
Puppet on a Chain        1
Beautiful World...       1
Name: title, Length: 197575, dtype: int64
2015    13978
2014     8209
2013     7664
2012     7273
2011     6844
        ...
1899        2
2024        2
1903        1
1897        1
1894        1
Name: year, Length: 124, dtype: int64

In [7]:
# 4. 전체 영화 개수; 215980
mt['title'].value_counts().sum()

215981

In [8]:
# 5. 가장 빠른 시기에 제작된 영화 2개; 'Miss Jerry', 'Reproduction of the Corbett and Fitzsimmons Fight'
mt.sort_values(by='year').head(2)

                                                    title  year
165182                                         Miss Jerry  1894
85708   Reproduction of the Corbett and Fitzsimmons Fight  1897

In [9]:
# 6. 제목이 'Hamlet'인 영화는 몇 개인가? 19개
print(list(mt['title']).count('Hamlet'))
print(mt[mt['title'] =='Hamlet'].count())
mt[mt['title'] =='Hamlet']

19
title    19
year     19
dtype: int64

         title  year
5562    Hamlet  1948
26160   Hamlet  2016
37373   Hamlet  2015
42224   Hamlet  1990
43511   Hamlet  1910
68239   Hamlet  1954
85741   Hamlet  1976
87781   Hamlet  1987
87971   Hamlet  2000
91710   Hamlet  1921
114224  Hamlet  1969
154627  Hamlet  1913
163645  Hamlet  2009
169996  Hamlet  1964
186988  Hamlet  1996
192815  Hamlet  2011
195015  Hamlet  1911
205821  Hamlet  1973
207793  Hamlet  2014

In [10]:
# 7. 제목이 'Treasure Island'는 몇 개인가? 제작년도 오름차순 나열;
print(list(mt['title']).count('Treasure Island'))

ti = mt[mt['title'] =='Treasure Island']
ti.sort_values(by='year')

8

                  title  year
191379  Treasure Island  1918
47769   Treasure Island  1920
192917  Treasure Island  1934
90175   Treasure Island  1950
104714  Treasure Island  1972
103646  Treasure Island  1973
190792  Treasure Island  1985
166675  Treasure Island  1999

In [11]:
# 8. 1950년에서 1959년 사이에 만들어진 영화는 몇 개인가?

cnt = 0

for i in range(1950, 1960):
    cnt += sum(mt['year'] == i)
print(cnt)

12120

In [12]:
mt1950 = mt['year'] >= 1950
mt1959 = mt['year'] <= 1959
mt[mt1950 & mt1959]

# is_moive1 = movies_title_sample['year'] >=1950
# is_movie2 = movies_title_sample['year'] < 1960
# subset_df = movies_title_sample[is_moive1 & is_movie2 ]
# subset_df

# mt1950 & mt1959

                                         title  year
9                               Women's Prison  1955
37      La momia azteca contra el robot humano  1958
86                            Botta e risposta  1950
88                         Perdeu-se um Marido  1957
106                             Qiu yu can hua  1953
...                                        ...   ...
215856                    Tischlein, deck dich  1956
215890                        Some Like It Hot  1959
215915                             Black Widow  1951
215919                             Encrucijada  1956
215945                       Te sigo esperando  1952

[12120 rows x 2 columns]

# 실습; 영화제목 수업

In [13]:
# 실습01 영화 타이틀: 수업
# 1. 영화 타이틀 데이터 셋 - movws_title.csv
# 2. titles의 df 구성
# 3. df 필수 명령 8개 실행
# 4. 전체 영화는 몇 개인가?
# 5. 가장 빠른 시기에 제작된 영화 2개
# 6. 제목이 'Hamlet'인 영화는 몇 개인가?
# 7. 제목이 'Treasure Island'는 몇 개인가? 제작년도 오름차순 나열
# 8. 1950년에서 1959년 사이에 만들어진 영화는 몇 개인가?

In [14]:
import numpy as np
import pandas as pd
print('np ver', np.__version__)
print('pd ver', pd.__version__)

titles = pd.read_csv("C:/Users/toto/Google Drive/sync/python/db/movies_title.csv")
titles.head()

np ver 1.20.1
pd ver 1.2.4

                     title  year
0           The Rising Son  1990
1        Ashes of Kukulcan  2016
2  The Thousand Plane Raid  1969
3         Crucea de piatra  1993
4                   The 86  2015

In [15]:
titles.tail()

                      title  year
215976       Le mouton noir  1922
215977  Edge of the Unknown  2015
215978                E yue  2005
215979         Lakota Girls  2015
215980         The Sting II  1983

In [16]:
titles.shape

(215981, 2)

In [17]:
titles.columns

Index(['title', 'year'], dtype='object')

In [18]:
titles.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 215981 entries, 0 to 215980
Data columns (total 2 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   title   215981 non-null  object
 1   year    215981 non-null  int64
dtypes: int64(1), object(1)
memory usage: 3.3+ MB

In [19]:
titles.describe()

                year
count  215981.000000
mean     1984.553822
std        29.343957
min      1894.000000
25%      1965.000000
50%      1994.000000
75%      2010.000000
max      2024.000000

In [20]:
titles.isnull().sum()

title    0
year     0
dtype: int64

In [21]:
# 1. 전체 영화 갯수
len(titles)

215981

In [22]:
titles.shape[0] # 행 갯수, 1은 열

215981

In [23]:
# 2. 가장 빠른 시기 영화
titles['year'].sort_values() # srs 형식

titles.sort_values(by='year').head(2)
# df에 직접 sort
# ascending=True(기본값)

                                                    title  year
165182                                         Miss Jerry  1894
85708   Reproduction of the Corbett and Fitzsimmons Fight  1897

In [24]:
# 영화 제목이 'Hamlet'
titles['title'] == 'Hamlet'

0         False
1         False
2         False
3         False
4         False
          ...
215976    False
215977    False
215978    False
215979    False
215980    False
Name: title, Length: 215981, dtype: bool

In [25]:
titles[titles['title'] == 'Hamlet']

         title  year
5562    Hamlet  1948
26160   Hamlet  2016
37373   Hamlet  2015
42224   Hamlet  1990
43511   Hamlet  1910
68239   Hamlet  1954
85741   Hamlet  1976
87781   Hamlet  1987
87971   Hamlet  2000
91710   Hamlet  1921
114224  Hamlet  1969
154627  Hamlet  1913
163645  Hamlet  2009
169996  Hamlet  1964
186988  Hamlet  1996
192815  Hamlet  2011
195015  Hamlet  1911
205821  Hamlet  1973
207793  Hamlet  2014

In [26]:
titles[titles['title'] == 'Hamlet'].shape[0]

19

In [27]:
len(titles[titles['title'] == 'Hamlet'])

19

In [28]:
# 제목 'Treasure Island' 연도 오름차순
titles['title'] == 'Treasure Island'

0         False
1         False
2         False
3         False
4         False
          ...
215976    False
215977    False
215978    False
215979    False
215980    False
Name: title, Length: 215981, dtype: bool

In [29]:
titles[titles['title'] == 'Treasure Island'].sort_values('year')

                  title  year
191379  Treasure Island  1918
47769   Treasure Island  1920
192917  Treasure Island  1934
90175   Treasure Island  1950
104714  Treasure Island  1972
103646  Treasure Island  1973
190792  Treasure Island  1985
166675  Treasure Island  1999

In [30]:
titles[titles['title'] == 'Treasure Island']['year'].sort_values()

191379    1918
47769     1920
192917    1934
90175     1950
104714    1972
103646    1973
190792    1985
166675    1999
Name: year, dtype: int64

In [31]:
# 1950 ~ 1959 사이의 영화

(titles['year'] >= 1950) & (titles['year'] <= 1959)

0         False
1         False
2         False
3         False
4         False
          ...
215976    False
215977    False
215978    False
215979    False
215980    False
Name: year, Length: 215981, dtype: bool

In [32]:
titles[(titles['year'] >= 1950) & (titles['year'] <= 1959)]

                                         title  year
9                               Women's Prison  1955
37      La momia azteca contra el robot humano  1958
86                            Botta e risposta  1950
88                         Perdeu-se um Marido  1957
106                             Qiu yu can hua  1953
...                                        ...   ...
215856                    Tischlein, deck dich  1956
215890                        Some Like It Hot  1959
215915                             Black Widow  1951
215919                             Encrucijada  1956
215945                       Te sigo esperando  1952

[12120 rows x 2 columns]

In [33]:
len(titles[(titles['year'] >= 1950) & (titles['year'] <= 1959)])

12120

In [34]:
titles[(titles['year'] >= 1950) & (titles['year'] <= 1959)].count()

title    12120
year     12120
dtype: int64

In [35]:
titles[(titles['year'] >= 1950) & (titles['year'] <= 1959)].shape[0]

12120

# pd 실습

In [36]:
# 실습01; 특정 위치의 데이터 추출

import pandas as pd

df = pd.DataFrame({'country':['벨기에', '인도', '브라질'],
                   'capital':['브뤼셀', '뉴델리', '브라질리아'],
                   'population':['1천만명', '13억명', '2억명']
                  }
                 )
df

# csv 파일을 만들어서 읽어올 수도 있음

  country capital population
0     벨기에     브뤼셀       1천만명
1      인도     뉴델리       13억명
2     브라질   브라질리아        2억명

In [37]:
# 슬라이싱해서 '13억명'  출력; label, position

df.iloc[1, 2] # 위치 인덱스

'13억명'

In [38]:
df.loc[1, 'population'] # row/컬럼으로 찾음

'13억명'

In [39]:
for row in df: # 컬럼명만 출력
    print(row)

country
capital
population

In [40]:
for row in range(0, len(df)): # row로 접근(인덱스민)
    print(df.iloc[row, 0])
    print(df.iloc[row, 1])
    print(df.iloc[row, 2])
    print('--------------')

벨기에
브뤼셀
1천만명
--------------
인도
뉴델리
13억명
--------------
브라질
브라질리아
2억명
--------------

In [41]:
df.iloc[1, 2] = '14억명' # 값 수정
df

  country capital population
0     벨기에     브뤼셀       1천만명
1      인도     뉴델리       14억명
2     브라질   브라질리아        2억명

In [42]:
df['population'] # 특정 열만 조회

0    1천만명
1    14억명
2     2억명
Name: population, dtype: object

In [43]:
scores = pd.DataFrame({'국어':[76, 90, 64, 70, 98],
                        '영어':[65, 75, 70, 82, 93],
                        '수학':[80, 98, 62, 84, 85]
                       }
                      )
scores

   국어  영어  수학
0  76  65  80
1  90  75  98
2  64  70  62
3  70  82  84
4  98  93  85

In [44]:
# 실습02; df에 '총점', '평균', '등급' 컬럼 추가

scores_result = scores.copy()
total_l = []
avg_l = []
grade_l = []

for j in range(0, len(scores)):
    
    total = 0
    for i in range(0, len(scores.columns)):
        total += scores.iloc[j, i]
        
    avg = round(total / len(scores.columns), 2)
    
    if total / len(scores.columns) >= 90:
        grade = 'S등급'
    elif total /len(scores.columns) >= 80:
        grade = 'A등급'
    elif total / len(scores.columns) >= 80:
        grade = 'B등급'
    else:
        grade = 'C등급'
        
    total_l.append(total)
    avg_l.append(avg)
    grade_l.append(grade)


scores_result['총점'] = total_l
scores_result['평균'] = avg_l
scores_result['등급'] = grade_l
scores_result

   국어  영어  수학   총점     평균   등급
0  76  65  80  221  73.67  C등급
1  90  75  98  263  87.67  A등급
2  64  70  62  196  65.33  C등급
3  70  82  84  236  78.67  C등급
4  98  93  85  276  92.00  S등급

In [45]:
# 실습02; 수업 답안

# 행별로 df 구성; 컬럼 개수가 정해졌을 경우
data = [[76, 65, 80],
        [90, 75, 98],
        [64, 70, 62],
        [70, 82, 84],
        [98, 93, 85]
       ]
df = pd.DataFrame(data,
                   columns=['국어', '영어', '수학']
                  )
df

   국어  영어  수학
0  76  65  80
1  90  75  98
2  64  70  62
3  70  82  84
4  98  93  85

In [46]:
# 총점 구하기
df['총점'] = df['국어'] + df['영어'] + df['수학']
df

   국어  영어  수학   총점
0  76  65  80  221
1  90  75  98  263
2  64  70  62  196
3  70  82  84  236
4  98  93  85  276

In [47]:
# 평균 구하기
df['평균'] = (df['국어'] + df['영어'] + df['수학']) / 3
df

   국어  영어  수학   총점         평균
0  76  65  80  221  73.666667
1  90  75  98  263  87.666667
2  64  70  62  196  65.333333
3  70  82  84  236  78.666667
4  98  93  85  276  92.000000

In [48]:
# 평균1 구하기
df.iloc[:, :3] # 3개 컬럼만 추출

df.iloc[:, :3].mean() # 컬럼별로 평균
df.iloc[:, :3].mean(axis=1) # 행별로 평균

df['평균1'] = df.iloc[:, :3].mean(axis=1)
df

df['총점1'] = df.iloc[:, :3].sum(axis=1)
df

   국어  영어  수학   총점         평균        평균1  총점1
0  76  65  80  221  73.666667  73.666667  221
1  90  75  98  263  87.666667  87.666667  263
2  64  70  62  196  65.333333  65.333333  196
3  70  82  84  236  78.666667  78.666667  236
4  98  93  85  276  92.000000  92.000000  276

In [49]:
# 평균을 등급으로 만들기
df['등급'] = ''

for row in range(0, len(df)):
#     print(df.iloc[row, 4])
    in_pos = df.iloc[row, 4]
    if in_pos >= 90:
        df.iloc[row, -1] = 'S등급' # 마지막 컬럼을 만들어 놔서
    elif in_pos >= 80:
        df.iloc[row, -1] = 'A등급' # -1로 마지막 컬럼에 삽입
    elif in_pos >= 70:
        df.iloc[row, -1] = 'B등급'
    else:
        df.iloc[row, -1] = 'C등급'
        
df

   국어  영어  수학   총점         평균        평균1  총점1   등급
0  76  65  80  221  73.666667  73.666667  221  B등급
1  90  75  98  263  87.666667  87.666667  263  A등급
2  64  70  62  196  65.333333  65.333333  196  C등급
3  70  82  84  236  78.666667  78.666667  236  B등급
4  98  93  85  276  92.000000  92.000000  276  S등급

In [50]:
# 행 단위로 적용
# 각 행마다 연산해서 값 추가
# 속도는 이 방법이 제일 빠름

df.loc[df['평균'] >= 90, '등급2'] = 'S등급'
df.loc[(df['평균'] >= 80) & (df['평균'] < 90), '등급2'] = 'A등급'
df.loc[(df['평균'] >= 70) & (df['평균'] < 80), '등급2'] = 'B등급'
df.loc[(df['평균'] < 70), '등급2'] = 'C등급'

df

   국어  영어  수학   총점         평균        평균1  총점1   등급  등급2
0  76  65  80  221  73.666667  73.666667  221  B등급  B등급
1  90  75  98  263  87.666667  87.666667  263  A등급  A등급
2  64  70  62  196  65.333333  65.333333  196  C등급  C등급
3  70  82  84  236  78.666667  78.666667  236  B등급  B등급
4  98  93  85  276  92.000000  92.000000  276  S등급  S등급

# py 객체, 클래스, 모듈, 함수 등

# 객체와 클래스

1. 객체 지향 프로그래밍(object oriented programming; oop)

2. 클래스(Class); 변수와 메소드로 구성, 붕어빵 틀

3. 클래스는 객체(자동차)를 표현합니다.
   - 변수 : 색상, 옵션, ...
   - 메소드 : 기능, 내비게이션, 블랙박스, ...

4. 인스턴스(차대번호가 있는 차, 붕어빵) = 클래스()

5. 클래스 : 똑같은 것을 계속 만들어 낼 수 있는 설계 도면

   인스턴스 : 설계 도면을 통해 만들어낸 것들

In [51]:
# 생성 방법

"""
class 클래스명: # 클래스명 첫문자 대문자, 각 단어 대문자 권장
    클래스 변수 선언 # 내부와 외부 변수 별도
    def 메소드명1: # 메소드: 클래스 내부의 함수를 메소드라 부름
        코드1
        코드2 ...
        return
    def 메소드명2:
        코드1
        코드2 ...
        return
    def 메소드명2:
        코드1
        코드2 ...
        return
"""

'\nclass 클래스명: # 클래스명 첫문자 대문자, 각 단어 대문자 권장\n    클래스 변수 선언 # 내부와 외부 변수 별도\n    def 메소드명1: # 메소드: 클래스 내부의 함수를 메소드라 부름\n        코드1\n        코드2 ...\n        return\n    def 메소드명2:\n        코드1\n        코드2 ...\n        return\n    def 메소드명2:\n        코드1\n        코드2 ...\n        return\n'

In [52]:
class Calculator:
    txt = '문자'
    def sum(self, a, b): # 클래스 내부의 메소드에는 (self, ) 선언 필수
        c = a + b
        return c

In [53]:
Calculator()

In [54]:
x = Calculator()
x.sum(3, 4)

7

In [55]:
y = x.sum(3, 4)
print(y)

7

In [56]:
y = Calculator().sum(3, 4)
y

7

In [57]:
x.txt

'문자'

In [58]:
# 클래스의 인자값 처리
# 클래스 내부의 일부 변수는 조작 가능

class Employee:
    def __init__(self, name, salary): # 생성표기 함수 문법, 클래스 실행될 때 반드시 실행 명령
        print('클래스를 시작합니다.')
        self.name = name # 우측의 name은 외부에서 가져오는 것
        self.salary = salary # self.name은 클래스 내부에서 별도 저장
    def displaycount(self):
        print('hello =', self.name)

In [59]:
x = Employee('홍길동', 100) # __init__ 메소드 실행

클래스를 시작합니다.

In [60]:
x.name

'홍길동'

In [61]:
 x.salary

100

In [62]:
x.displaycount() # 인스턴스 변수; 내부에서만 작동하는 변수

hello = 홍길동

In [63]:
y = Employee('이순신', 200)

클래스를 시작합니다.

In [64]:
y.name

'이순신'

In [65]:
y.salary

200

In [1]:
class Job:
    def __init__(self, name, salary):
        self.name = name
        self.salary = salary
    def pay(self):
        print('pay =', self.salary * 10)
    def incentive(self, money):
        print('incentive =', money)

In [2]:
x = Job('길동', 123)
print(x)

<__main__.Job object at 0x0000021BAE2F48B0>

In [68]:
x.pay()

pay = 1230

In [69]:
x.incentive(233)

incentive = 233

In [70]:
# 모듈 불러오기
# import 모듈명
# import 모듈명 as 약칭
# from 모듈명 import 클래스명1, 클래스명2, ...

# 모듈 설치

1. 오타 확인

2. 설치가 안되어 있을 때 설치 작업
   - conda promt; conda install 라이브러리명 or pip install 라이브러리명

3. conda or pop 설치 에러 메시지
   - https://www.lfd.uci.edu/~gohlke/pythonlibs/
   - url에서 해당 라이브러리.whl 다운로드 후 
   - conda/pip install 라이브러리명.whl

In [71]:
!pip install selenium # 아나콘다 프롬트 동작과 같음

ERROR: Invalid requirement: '#'

In [72]:
%%writefile  main.py

if __name__ == '__main__': # __name__ 시스템의 변수명
    print('모듈 시작.')
    print('__name__ =', __name__)
    print('모듈 끝.')
else:
    print('다른 모듈에서 import 수행시 실행,')
    print('__name__', __name__)

Overwriting main.py

In [73]:
# %%매직명령어 이전에 주석달지 말것
# 프로그램 실행

In [74]:
!python main.py

모듈 시작.
__name__ = __main__
모듈 끝.

In [75]:
# if 조건 실행; main 값 들어가있음

In [76]:
import main

다른 모듈에서 import 수행시 실행,
__name__ main

In [77]:
# 직접 실행할 수 있고, 다른 모듈에서 불러오게 할 수 있음

In [78]:
%%writefile calc.py

def add(a, b):
    return a + b
def mul(a, b):
    return a * b
def sub(a, b):
    return a - b
if __name__ == '__main__':
    print('** main ** ')
    print(add(10, 20))
    print(mul(10, 20))
    print(sub(10, 20))

Overwriting calc.py

In [79]:
!python calc.py

** main **
30
200
-10

In [80]:
import calc

In [81]:
calc.add(3, 5)

8

In [82]:
# import해서 함수 활용 가능

### 함수 내 지역변수, 전역변수

In [83]:
a = 5 # 함수 밖에서 작동하는 변수; 전역변수
def func1():
    a = 1 # 함수 내에서만 작동하는 변수; 지역변수
    print('111 a = ', a)
    return a # 외부에서도 작동하게끔 반환

In [84]:
func1()

111 a =  1

1

In [85]:
a

5

In [86]:
a = 5 # 함수 밖에서 작동하는 변수
def func2():
    global a #전역변수; 밖에서 선언된 함수를 들여오는 것
    a = 1 # 함수 내에서만 작동하는 변수; 지역변수
    print('222 a = ', a)
    return a # 외부에서도 작동하게끔 반환

In [87]:
func2()

222 a =  1

1

# 함수들

In [88]:
# 파이썬 표준 라이브러리(외장함수)
# sys csv datetime calendar collections 자주 사용

In [89]:
# 내장함수

# https://docs.python.org/ko/3/library/functions.html
# https://www.w3schools.com/python/python_ref_functions.asp

In [90]:
# id()

a = 1
b = 2

id(a) # 객체 값이 들어간 데이터의 주소

id(b)

140722374387536

In [91]:
c = 2
d = c

id(c)
id(d) # 같음

140722374387536

In [92]:
b = 3
id(b)

140722374387568

In [93]:
id(c)

140722374387536

In [94]:
d

2

In [95]:
# mutable vs immutable

a1 = [1, 2, 3]
b1 = a1
id(a1)

2190745127616

In [96]:
id(b1)

2190745127616

In [97]:
a1[1] = 99
a1

[1, 99, 3]

In [98]:
b1

[1, 99, 3]

In [99]:
id(a1)

2190745127616

In [100]:
id(b1)

2190745127616

In [101]:
c1 = a1.copy()

In [102]:
d1 = a1[:]
id(d1) # 다른 아이디 부여

2190780533504

In [103]:
id(a1) == id (b1) # id를 비교, a = b와는 다름

True

In [104]:
sea = ['a', 'b', 'c', 'd']
sea

['a', 'b', 'c', 'd']

In [105]:
sea[0]

'a'

In [106]:
sea[1]

'b'

In [107]:
enumerate(sea)

In [108]:
list(enumerate(sea))

[(0, 'a'), (1, 'b'), (2, 'c'), (3, 'd')]

In [109]:
x = ('a', 'b', 'c')
y = enumerate(x)
list(y)

[(0, 'a'), (1, 'b'), (2, 'c')]

In [110]:
# eval()

x = 1
x

1

In [111]:
x + 1

2

In [112]:
a = 'x + 1'
a

'x + 1'

In [113]:
eval(a) # 문자열을 없애고, 변수처럼 계산해줌

2

In [114]:
x = 'print(55)'
x

'print(55)'

In [115]:
eval(x)

55

In [116]:
b = eval('100 + 32')
b

132

In [117]:
# filter() 자주 사용; 함수와 iterable을 넣어줌

ages = [5, 12, 17, 18, 24, 32]

def myfunc(x):
    if x < 18:
        return False
    else:
        return True

In [118]:
myfunc(5)

False

In [119]:
# myfunc(ages) # 리스트를 넣으면 동작하지 않음

In [120]:
list(filter(myfunc, ages))
# iterable(리스트형)를 함수에 넣어서 데이터를 찾아옴
# T/F로만 구성된 함수에서 T만 출력하는 데이터를 찾아옴

[18, 24, 32]

In [121]:
target = list(range(1, 11))
target

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [122]:
# 짝수만 골라내기

def is_even(n):
    return True if n%2 ==0 else False

In [123]:
list(filter(is_even, target))

[2, 4, 6, 8, 10]

In [124]:
list(filter(lambda x : x % 2 == 0, list(range(1, 11))))
# 한번만 사용한다면 함수를 정의할 필요 없이, 람다 사용

[2, 4, 6, 8, 10]

In [125]:
# map(function, iterable, ...); 매우 중요

def myfunc(n):
    return len(n)
list(map(myfunc, ('apple', 'banana', 'cherry')))
#

[5, 6, 6]

In [126]:
myfunc('banana')

6

In [127]:
def myfunc2(n):
    return n + 1
target = [1, 2, 3, 4, 5]
list(map(myfunc2, target))

[2, 3, 4, 5, 6]

In [128]:
list(map(lambda x: x + 1, target))
# 리스트의 첫번째를 x에 적용해서 도출된 값을 리스트에 쌓음

[2, 3, 4, 5, 6]

In [129]:
# lambda 함수; 함수의 일종, 임시로 한번만 쓰는 함수

In [130]:
def x(a):
    return a + 10
x(5)

15

In [131]:
y = lambda a: a + 10
y(5)

15

In [132]:
(lambda a: a + 10)(5)

15

In [133]:
(lambda a, b: a * b)(5, 6)

30

In [134]:
def myfunc(n):
    return lambda a: a * n
myfunc(2)(11)

22

In [135]:
(lambda a: a * 2)(11) # 위 함수와 같음

22

In [136]:
# zip()

x = list(range(1, 4))
x

[1, 2, 3]

In [137]:
y = list(range(4, 7))
y

[4, 5, 6]

In [138]:
print('x = ', x)
print('y = ', y)

x =  [1, 2, 3]
y =  [4, 5, 6]

In [139]:
# 같은 인덱스의 요소끼리 묶어줌
# 갯수가 다르면 같은 인덱스까지만 묶음

In [140]:
# list, dict, tup, set method

# lst; append, copy, count, extend, insert
# dict; copy, items, keys, value
# set; union difference intersection